package com.neuedu.object.homework;

public class Example {
    /**
     * 1: 商品信息
     *    商品名，商品单价，库存，商品id
     *  Goods（  goodsname，price，repertory，goodsid）
     * 2：商品信息中存放商品
     *   数组|集合
     *   List
     * 3：付款
     *   商品输入（商品名，数量）到电脑
     *    电脑给出：商品名， 售价，数量，金额，商品id
     *
     *    统计：商品的数量：商品名进行统计
     *          个数数量：数量之和
     *          总计：金额之和
     *
     *1）输入商品名，数量
     * 2）商品名， 售价，数量，金额，商品id
     *    统计：商品的数量：商品名进行统计
     *          个数数量：数量之和
     *          总计：金额之和
     *    数据库调用|计算得到
     * 3）结束，打印小票
     *
     *
     *
     * **/
}
