package com.neuedu.choose;

public class Example {
    /**
     * 目的：1：判断条件怎么写 2：if怎么应用
     *
     * 1：判断输入的年份是否是闰年，如果是闰年输出“xx年是闰年”，
     * 如果不是，输出“xx年不是闰年”
     *
     * 1)判断条件
     * 四年一润，百年不润
     * 四百年一润
     *  n
     *  n%4==0 && n%100!=0
     * or n%400==0
     *
     * 2）
     *
     *
     * 2：根据输入的成绩，判断输出的等级
     *    当成绩在[90,100] ,等级为A
     *    当成绩在[80,90),等级为B
     *    当成绩在[70,80),等级为C
     *    当成绩在[60,70),等级为D
     *    当成绩在[0,60),等级为E
     *   score :
     *  判断条件：1：[0-100]  score>=0 && score<=100
     *            2:[90,100],[80,90),[70,80),[60,70),[0,60)
     *              score>=90 && score<=100
     *              score>=80 && score<90
     *              score>=70 && score<80
     *              score>=60 && score<70
     *              else
     *
     * */

    /**
     *选择语句：根据条件有个判断，有两个结果：1：真true
     *                                        2：假false
     *  1：if（条件判断）{
     *      真执行的语句
     *  }
     *  2：  if（条件判断）{
     *      真执行的语句
     *  }else{
     *      假值的执行语句
     *
     *  }
     *    3：  if（条件判断）{
     *      if（条件判断）{
     *
     *      }else{
     *
     *      }
     *
     *  }else{
     *      if（条件判断）{
     *
     *      }else{
     *
     *      }
     *
     *  }
     *
     *  -- 特殊的
     *  if（条件判断）{
     *   语句1
     *  }else if(条件判断2){
     *   语句2
     *  }else if（条件判断3）{
     *      语句3
     *  }else{
     *     语句4
     *  }
     *
     * **/
}
