package com.neuedu.repeat;
public class Example {
    /**
     *
     * 1：输入一个数，判断是否是素数，如果是，则输出“yes” ，
     * 如果不是，输出“no”
     *素数：只能够被1和自身整除的数
     *      2 3 5 7 11
     *
     *      num
     *      boolean flag=true; //是素数
     *   for(int i=2;i<num;i++){
     *       if(num%i==0){
     *           flag=false;
     *           break;
     *       }
     *   }
     *
     *
     *
     *
     * 2：输出100到200之间所有的素数
     *
     *
     * **/

    /**
     * 循环：1）重复执行一段相同代码|任务 2）结束的条件
     * for(表达式1;表达式2;表达式3){
     *     循环体
     * }
     * 表达式1：初始化 int i=0
     * 表达式2：判断语句   如果满足条件执行循环体，不满足，退出循环
     * 表达式3：趋于结束的表达式
     * 执行顺序：1，2，循环体，3，2，循环体，3，2
     * for(int i=1;i<=10;i++){
     *     sum+=i;===》sum=sum+（i）
     * }
     * a2 b3 c4
     *   a*=b+c
     *   a=a*(b+c)
     * **/

}
