package com.neuedu.object;

public class Example {
    /**
     *   面向对象
     *  1:人机猜拳
     *  2：纸牌
     *
     * **/
    /**
     * 1：面向对象：
     *
     * 2：类--图纸：一组相同的静态数据和动态数据的抽象
     *                         属性：变量   方法
     *    对象--楼：一个类的实例化对象
     *                  new
     *
     *3:三大特征;
     *   封装：保证数据的安全
     *         将属性私有化
     *         实现：1）通过构造器
     *               2)通过getter和setter进行设置
     *   继承：
     *       一个类被另一个类继承，实现所有的方法，
     *       其中：被继承的类--父类|超类
     *             继承类--子类
     *       特点：1：代码的重用
     *             2：子类不光有了父类的特征，还有自己独有的特征。
     *   多态：
     *      调用同一方法实现不同的形态
     *      三个条件：1：有继承|实现
     *                 2:子类有父类重写方法
     *                 3：父类的对象使用子类来实例化
     *
     *
     *
     *
     * **/

}
